Repository: booooohdan/flutter_wt_versus
Catalog: lib/l10n/app_*.arb
Languages: ru, uk

source: Done
ru: Готово
uk: Готово

source: Compare
ru: Сравнить
uk: Порівняти

source: Planes
ru: Самолеты
uk: Літаки

# army
source: Tanks
ru: Танки
uk: Танки

source: Heli
ru: Верт.
uk: Верт.

# fleet
source: Ships
ru: Флот
uk: Флот

source: Hello there
ru: Привет
uk: Привіт

source: Welcome back!
ru: З возвращением!
uk: З поверненням!

# sign_up
source: Sign Up with Google
ru: Войти з помощью Google
uk: Увійти за допомогою Google

# sign_up_apple
source: Sign Up with Apple
ru: Войти з помощью Apple
uk: Увійти за допомогою Apple

# why_login
source: Why do I need login?
ru: Для чего нужна авторизация?
uk: Для чого потрібна авторизація?

source: Feedback
ru: Фидбек
uk: Фідбек

source: Logout
ru: Выход
uk: Вихід

source: Version
ru: Версия
uk: Версія

# versus_description
source: WT Versus can compare aircraft, helicopters, tanks, and ships from the game War Thunder. All images and descriptions have been taken from open sources and wiki.warthunder.com
ru: WT Versus может сравнивать самолеты, вертолеты, танки и корабли из игры War Thunder. Все картинки и описания взяты з открытых источников и сайта wiki.warthunder.com
uk: WT Versus може порівнювати літаки, танки, гелікоптери та кораблі у грі War Thunder. Всі картинки та описи взяті з відкритих джерел та сайту wiki.warthunder.com

source: Rate
ru: Оценка
uk: Оцінка

source: Share
ru: Поделиться
uk: Поділитись

source: Email
ru: Почта
uk: Пошта

source: Privacy
ru: Конфиденциальность
uk: Конфіденційність

source: Warning!
ru: Внимание!
uk: Увага!

# email_description
source: Please use the GitHub button for bug report or suggestions (Sign-in via Google). On GitHub you are guaranteed to get an answer and a quick response email: waveappfeedback@gmail.com
ru: Пожалуйста, используйте GitHub для предложений и сообщений об ошибках (Можно залогинится через Google). На GitHub вы гарантировано получите быстрый ответ и исправления ошибок Почта: waveappfeedback@gmail.com
uk: Будь ласка, використовуйте GitHub для пропозицій, або повідомлення про баги (Можна залогінитись через Google). На GitHub ви гарантовано отримаєте швидку відповідь та виправлення помилок Пошта: waveappfeedback@gmail.com

source: Got it
ru: Понятно
uk: Зрозуміло

source: Selected vehicles
ru: Выбранная техника
uk: Вибрана техніка

source: Search..
ru: Поиск..
uk: Пошук..

source: Clear
ru: Очистить
uk: Очистити

# please_select_2_vehicles
source: Please select 2 or more vehicles
ru: Пожалуйста выберите две единицы техники, или больше
uk: Будь ласка виберіть дві одиниці техніки, або більше

source: Helicopters
ru: Вертолеты
uk: Гелікоптери

# placeholder_title
source: Page under development
ru: Страница в разработке
uk: Сторінка в розробці

# placeholder_button
source: Back
ru: Назад
uk: Назад

source: Comparison
ru: Сравнение
uk: Порівняння

source: AB
ru: АБ
uk: АБ

source: RB
ru: РБ
uk: РБ

source: SB
ru: СБ
uk: СБ

# introduction_title1
source: Welcome
ru: Добро пожаловать
uk: Ласкаво просимо

# introduction_body1
source: to War Thunder Versus 3
ru: в War Thunder Versus 3
uk: до War Thunder Versus 3

# introduction_title2
source: All vehicles available
ru: Вся техника в наличии
uk: Вся техніка в наявності

# introduction_body2
source: Even a bombers and boats. Premium, rare, PSX and XBOX exclusive, deleted vehicle, all of them in this app
ru: Даже бомбардировщики и катера. Премиальная, редкая, эксклюзивная для PSX и XBOX и удаленная техника доступна в этом приложении.
uk: Навіть бомбардувальники і катери. Преміальна, рідкісна, ексклюзивна для PSX i XBOX і видалена техніка доступна в цьому додатку

# introduction_title3
source: Potential enemies section
ru: Но в этой версии доступно только сравнение самолетов
uk: Але в цій версії доступне лише порівняння літаків

# introduction_body3
source: This future will be added later. Please stay with us
ru: Другие сравнения будут добавлены позже, в следующем обновлении
uk: Інші порівняння буде додано пізніше, в наступному оновленні

# introduction_title4
source: It's not final data
ru: Это не окончательные данные
uk: Це не остаточні дані

# introduction_body4
source: Another characteristics will be add some later, approximately at this spring
ru: Другие характеристики будут добавлены позже, примерно этой весной
uk: Інші характеристики будуть додані пізніше, приблизно цієї весни

source: No data
ru: Нет данных
uk: Немає даних

source: Game Data
ru: Игровые данные
uk: Ігрові дані

source: Repair cost
ru: Стоимость ремонта
uk: Вартість ремонту

source: Flight characteristics
ru: Летные характеристики
uk: Льотні характеристики

source: Max Speed (km/h)
ru: Максимальная скорость (км/ч)
uk: Максимальна швидкість (км/г)

source: Cooling system
ru: Система охлаждения
uk: Система охолодження

source: Engine type
ru: Тип двигателя
uk: Тип двигуна

# weapon_and_turret
source: Weapons & Turrets
ru: Вооружения и турели
uk: Озброєння та турелі

source: Offensive armament
ru: Наступательное вооружение
uk: Наступальне озброєння

source: Defensive armament
ru: Оборонительное вооружение
uk: Оборонне озброєння

source: Max Altitude (m)
ru: Максимальная высота (м)
uk: Максимальна висота (м)

source: Turn Time (s)
ru: Время виража (с)
uk: Час віражу (с)

source: Weight (t)
ru: Вес (т)
uk: Вага (т)

source: Structural destruction (km/h)
ru: Разрушение конструкции (км/ч)
uk: Руйнування конструкції (км/г)

source: Gear destruction (km/h)
ru: Разрушение шасси (км/ч)
uk: Руйнування шасі (км/г)

source: Features
ru: Особенности
uk: Особливості

source: Engine name
ru: Название двигателя
uk: Назва двигуна

source: at
ru: на
uk: на

source: m
ru: м
uk: м

source: Cannon and guns
ru: Пушка и пулеметы
uk: Гармати і кулемети

source: Main cannon
ru: Главный калибр
uk: Головний калібр

source: Reload time (s)
ru: Время перезарядки (с)
uk: Час перезаряджання (с)

source: Gun depression (°)
ru: - УВН (°)
uk: - кут вертикального нахилу (°)

# gun_increase
source: Gun happiness (°)
ru: + УВН (°)
uk: + кут вертикального нахилу (°)

source: Armor and defense
ru: Броня и защита
uk: Броня та захист

# turret_armor_mm
source: Turret armor (front/side/back) (mm)
ru: Броня башни (спереди/сбоку/сзади) (мм)
uk: Броня башти (передня/бічна/задня) (мм)

# hull_armor_mm
source: Hull armor (front/side/back) (mm)
ru: Броня корпуса (спереди/сбоку/сзади) (мм)
uk: Броня корпусу (передня/бічна/задня) (мм)

source: Crew (people)
ru: Экипаж (человек)
uk: Екіпаж (чоловік)

source: Vehicle characteristics
ru: Технические характеристики
uk: Технічні характеристики

source: Reverse Speed (km/h)
ru: Скорость заднего хода (км/ч)
uk: Швидкість заднього ходу (км/г)

source: Engine power (h.p)
ru: Мощность двигателя (л.с.)
uk: Потужність двигуна (л.с.)

source: Power to weight ratio (h.p/t)
ru: Отношение мощности к весу (л.с./т)
uk: Відношення потужності до ваги (h.p/t)

source: Cannons
ru: Пушки
uk: Гармати

source: Turrets
ru: Турели
uk: Турелі

source: Displacement
ru: Водоизмещение
uk: Водотоннажність

source: Number of sections
ru: Количество отсеков
uk: Кількість відсіків

# armor_front_side_back_mm
source: Armor
ru: Броня
uk: Броня

# github
source: Report a bug
ru: Сообщить об ошибке
uk: Повідомити про помилку

source: Filter
ru: Фильтр
uk: Фільтр

source: Nations
ru: Нации
uk: Нації

source: Ranks
ru: Ранги
uk: Ранги

source: Vehicle types
ru: Типы транспортных средств
uk: Типи транспортних засобів

source: Battle Ratings
ru: Боевой рейтинг
uk: Бойовий рейтинг

source: Premium or not
ru: Премиум / Не премиум
uk: Преміум / Не преміум
